#include "DxLib.h"


//
// 極端にいえばスクラッチとＵＩ（ユーザーインターフェース）がちがうだけで、プログラムの流れは同じです。
// スクラッチと照らし合わせて進めると理解しやすいです。
//

// ここでやっていること
// 　＊【プログラム基礎】構造・プログラムの流れはスクラッチと同じ。命令があり組み合わせていく、上から解釈されて実行される。
// 　＊【プログラム基礎】{から}の間まで、プログラムが上から順番に実行されます。
// 　＊【API】ウィンドウモードとフルスクリーンモードの違いについて説明
//   ＊【ゲーム技術】ダブルバッファとティアリングの仕組みについて説明
//   ＊【API】文字列を画面に表示する
//   ＊【ゲーム技術】座標系の話、色について（光の三原色）
// 　＊【API】何かの入力まち　終了処理
// 
// 
// いろいろ弄ってみる
// 　＊ウィンドウモードを変更してみる。
// 　＊文字列を変更してみる。座標を変えてみる。色を変えてみる。
// 　＊ちょっとした自己紹介文を作ってみよう。
// 　＊WaitKeyを無効にするとどうなるか試してみよう。
//
// 

// WinMain関数から処理が始まります
int WINAPI WinMain(HINSTANCE hInstance, HINSTANCE hPrevInstance, LPSTR lpCmdLine, int nCmdShow)
{
    // ウィンドウモードに設定（フルスクリーンにしたい場合は false にする）
    ChangeWindowMode(TRUE);

    // DXライブラリの初期化処理（これおまじない）
    if (DxLib_Init() == -1)
    {
        return -1; // 初期化に失敗したら終了
    }

    // 描画先を裏画面に設定（チラつき防止）
    SetDrawScreen(DX_SCREEN_BACK);

    // 画面を消去（いったん画用紙を真っ黒にする）
    ClearDrawScreen();

    // --------------------------------------------------
    // 文字を表示する処理
    // DrawString( X座標, Y座標, 表示する文字列, 文字の色 );
    // --------------------------------------------------
    DrawString(0, 100, "Hello, DX Library!", GetColor(255, 255, 255));
    DrawString(100, 140, "DXライブラリへようこそ！", GetColor(255, 200, 100));

    // 裏画面の内容を表画面に反映
    ScreenFlip();

	// ここで入力待ちをすることで、ウィンドウがすぐに閉じないようにします。
    WaitKey();

    // DXライブラリの終了処理
    DxLib_End();

    return 0;
}